# ðŸ§· Pandas DataFrame Merge

#### Â» Import the Pandas library, usually abbreviated as `pd`

In [1]:
import pandas as pd

#### Â» Create a DataFrame with a dictionary

In [2]:
df1 = pd.DataFrame({"employees": ["Jeff", "Amanda", "Robert"], "group": ["Engineering", "HR", "Engineering"]})
df1

  employees        group
0      Jeff  Engineering
1    Amanda           HR
2    Robert  Engineering

In [3]:
df2 = pd.DataFrame({"employees": ["Jeff", "Amanda", "Robert"], "date": [2010, 2009, 2019]})
df2

  employees  date
0      Jeff  2010
1    Amanda  2009
2    Robert  2019

#### Â» Merge two dataframes using a common column (employees)

In [4]:
df3 = pd.merge(df1, df2)
df3

  employees        group  date
0      Jeff  Engineering  2010
1    Amanda           HR  2009
2    Robert  Engineering  2019

#### Â» Merge two dataframes on the specified label column

In [5]:
pd.merge(df1, df2, on="employees")

  employees        group  date
0      Jeff  Engineering  2010
1    Amanda           HR  2009
2    Robert  Engineering  2019

In [6]:
df4 = pd.DataFrame({"group": ["Engineering", "HR"], "manager": ["Sarah", "Joe"]})
df4

         group manager
0  Engineering   Sarah
1           HR     Joe

#### Â» Merge two dataframes to include 'manager' info based on 'group'

In [7]:
pd.merge(df3,df4)

  employees        group  date manager
0      Jeff  Engineering  2010   Sarah
1    Amanda           HR  2009     Joe
2    Robert  Engineering  2019   Sarah

In [8]:
df5 = pd.DataFrame({"group": ["Engineering", "HR", "Engineering", "IT"], "skills": ["math", "excel", "coding", "management"]})
df5

         group      skills
0  Engineering        math
1           HR       excel
2  Engineering      coding
3           IT  management

In [23]:
df1

  employees        group
0      Jeff  Engineering
1    Amanda           HR
2    Robert  Engineering

#### Â» Inner (default): include only matching rows from both dataframes

In [9]:
pd.merge(df1, df5)

  employees        group  skills
0      Jeff  Engineering    math
1      Jeff  Engineering  coding
2    Amanda           HR   excel
3    Robert  Engineering    math
4    Robert  Engineering  coding

#### Â» Outer: include all rows from both dataframes, fill NaN where no match

In [10]:
pd.merge(df1, df5, how="outer")

  employees        group      skills
0      Jeff  Engineering        math
1      Jeff  Engineering      coding
2    Robert  Engineering        math
3    Robert  Engineering      coding
4    Amanda           HR       excel
5       NaN           IT  management